package org.college.ap.wordly;

import java.util.Scanner;
import java.security.SecureRandom;
public class main {
    public static void main(String[] args) {


        Scanner sc = new Scanner(System.in);

        System.out.println("Меню гри:");
        System.out.printf("Виберіть кількість гравців: \n // 1 гравець \n // 2 гравця \n");

        int turnplayer = sc.nextInt();



        if (turnplayer == 1) {
            System.out.println("Ви вибрали режим на одного гравця");
            turnLevel();
        } else if (turnplayer == 2) {
            System.out.println("Ви вибрали режим на два гравця");
            String twoPlayers = usersInput();
        }

        System.out.println("У вас є 6 спроб");

        sc.close();

    }

    public static void turnLevel() {

        Scanner sc = new Scanner(System.in);

        SecureRandom random = new SecureRandom();

        boolean one = false; // lvl 1
        boolean two = false;// lvl 2
        boolean three = false;// lvl 3

        System.out.printf("Виберить веберіть складність: \n ** 1 level \n ** 2 level \n ** 3 level \n");
        int usersTurn = sc.nextInt(); // выбор уровня сложности


        do {
            if (usersTurn == 1) {
                one = true;
                break;
            } else if (usersTurn == 2) {
                two = true;
                break;
            } else if (usersTurn == 3) {
                three = true;
                break;
            } else {
                System.out.println("Помилка. Здійсніть спробу ще раз");
            }
        }
        while (true);

        String[] words = null;

        if (one == true) {
            String list1 = "Арена Базар Балет Банка Баран Батон Берег Білка Білий Бірка Бокал Бонус Бочка Браво Брама Брова Бруд Будка Букет Булка Буран Вагон Вахта Весна Весло Відео Візок Війна Вікно Вілла Віник Візит Вірус Вітер Влада Вокал Ворон Ворог Вступ Вчора Гараж Глина Глузд Голос Гольф Гонор Город Горох Гроза Група Груди Гумор Гусак Дамба Двері Декор Декан Десна Диван Дикий Димар Дірка Діток Діжка Доказ Догма Донор Дошка Драка Дрова Думка Дупло Дурак Дужий Душно Екран Емаль Епоха Етика Ефір Жарко Жести Живіт Живий Жінка Жовта Жорна Жупан Завод Загін Задум Зайве Заказ Закид Залив Замок Замір Запас Запах Запис Зараз Заряд Засув Затор Заява Зброя Звуки Зебра Земля Зірка Зміна Знаки Замок Зрада Зріст Зсуви Ікона Імідж Імена Кабан Казан Казка Канал Канат Канон Карти Каска Катер Качка Квіти Кермо Килим Кирка Китай Кішка Класс Кліпи Клоун Клуби Книга Кобза Козак Козел Козир Кокос Колія Колос Комар Комік Комір Контр Конус Копач Копія Короб Корок Косар Котел Кофта Крама Краса Криза Крик Крило Круги Крупа Кузов Кулак Кумир Купол Кусок Кухня Лампа Лапка Ласка Легко Ледар Лепет Лиман Лимон Липка Листя Лікар Лілія Лінія Ліжко Літак Логін Лодка Ложка Лопух Лотос Лоток Луска Любов Мавпа Магія Мазут Маляр Малюк Манія Марка Марно Маска Масло Масти Матчі Матор Матро Мафія Меблі Медаль Метав Метал Метан Мітла Метро Мирна Миска Мишка Мізер Мізки Місце Місто Мітка Міцно Млин Мозок Мокра Молод Молот Монах Морда Мороз Мости Мотив Морва Морква Моряк Музей Музика Муляж Муляр Мумія Муфта Набір Навик Наган Надія Назад Назва Накат Накид Наказ Налог Намив Намір Напад Напій Напис Народ Насос Наука Нафта Нахил Нація Невод Нелад Нерви Нижня Низка Нитки Нитка Німфа Нічка Новий Новик Ножка Номер Норма Носки Носик Носок Нотка Облич Обмін Образ Обрій Оброк Обсяг Овочі Огляд Одежа Один Озеро Океан Окрас Окунь Олива Олово Олень Опера Опіка Опора Орган Орден Орел Осінь Острів Отвір Отара Офіси Оцінка Очама";
            words = list1.trim().split(" ");
        } else if (two == true) {
            String list2 = "Абрис Абзац Аврал Агент Адепт Азимут Акорд Актор Акула Алібі Алмаз Алтар Амеба Анонс Аорта Аспект Архів Атлас Атлет Багаж Байка Баланс Балка Балон Барак Барій Барит Барок Барон Батіг Бекас Бетон Бидло Битва Біржа Бісер Бланк Блеф Блиск Блоха Блюдо Боєць Бонус Брова Бронь Брюки Булат Бухта Вакуум Вальс Варта Вибір Вигук Вимір Вираз Висок Вихор Вишка Вівця Відбір Відгук Відсіч Візир Вклад Вплив Вступ Вузол Вушко Вихід Вирок Гамма Гідна Гніздо Гонор Грань Гриф Гроно Гряда Грижа Дання Декор Дельта Демон Десна Дефіс Динар Дишло Догма Дозор Докір Допис Досвід Досьє Дотик Дохід Драже Дрель Дрейф Дрож Дуель Дукат Дупло Екран Екзит Емаль Емісія Епоха Етика Ефект Ефір Жарти Жетон Живло Житло Жнива Жокей Журна Завал Задор Зазор Закид Закуб Залог Замір Замша Занос Запит Зарив Заряд Засов Засуха Затиш Затор Зачит Заява Збірка Зваба Звиви Згода Здвиг Зефір Зірка Злаки Зміна Зміст Зразок Зріст Зусил Ідеал Ідіот Ікона Імідж Імпакт Імпорт Інжир Іспит Іскра Істер Ітера Казус Какао Калач Камін Канон Каноє Карат Карма Каста Катод Кварц Квота Кегля Келих Кивок Кисет Кисть Кишка Ківер Кілок Кіоск Кіста Кліше Клуня Кляса Клямка Кніпе Кожух Кокон Колаж Колос Кольє Кольт Комин Комір Комуна Коник Конус Копія Копун Коран Корба Коруп Косак Косий Косар Котел Кошик Крафт Кредо Криза Криця Крона Крупа Кузов Кукіль Кулон Кумир Купець Купол Курган Курта Кутик Кучер Лаваш Лавка Ладна Ланка Латекс Латиш Латки Легіт Ледар Лепет Лесто Лимон Лиман Лимба Лихва Лицар Лірик Літра Логіка Локус Лопух Лотос Лоток Лунка Луска Люлька Ляпас Магма Мазут Макет Маляр Манія Манеж Манка Манто Марка Масив Масть Мафія Медіа Метан Метиз Метро Митар Миття Мізер Мінус Мірка Модем Модус Модуль Мотив Муляж Муляр Мумія Муфта Набір Набув";
            words = list2.trim().split(" ");
        } else if (three == true) {
            String list3 = "Абрек Багва Бакан Балок Баляс Барда Башли Бгати Бебех Беніт Берло Берце Бздура Бинда Бодня Борей Борня Брила Бринь Бриця Брова Бруси Брухт Бриль Букат Буква Букша Булат Бульк Бусол Бутон Буття Бухта Бучне Бушла Бювар Бюрет Вагра Вайда Вакар Валок Валун Вапно Варта Ватка Ватра Вдача Велет Велюр Верба Верпа Верни Верса Верст Верхи Верша Вирва Вирій Висок Витяг Вічко Влася Волан Волот Врода Вуйко Вушко Гавра Газда Галас Галуз Гаман Гамуз Гарус Гвалт Гедзь Герег Герць Гилля Гірка Гість Глава Глей Глива Гляка Гніда Гноти Гомін Гонти Горяк Града Грива Гроно Гроші Груди Гряда Гужва Гуляш Дарак Дебіт Дзвін Дзюб Дишло Днесь Драга Драже Драна Дриги Дукат Дупел Дуття Дюжий Екзем Еклер Елюат Епіда Еподи Ераті Еспри Жабунь Жвало Жерло Живло Жнива Жорна Жупан Забій Зав'язь Загон Заклад Закут Залом Замах Замин Замша Запад Зарод Засів Засов Заступ Засуха Затон Затик Зваба Згадка Зипун Золов Зрачок Зубило Зябли Ібиси Іврит Ізвод Ікота Ілеус Імаго Імбирь Індри Інтел Іприт Ірида Кагат Кадіб Казан Казяк Калам Калим Каптур Карби Карий Карст Карюк Катів Катма Кашне Кведа Квидл Квола Кирпа Кисет Кичка Кобза Ковбик Краса Криця Кряж Кураж Курва Кухта Ладан Ладво Лакей Ламут Лапик Лапта Легіт Лимар Линва Литва Лоція Лубни Лудик Лунка Лутка Люшня Ляпас Маляр Манто Мацак Мигда Мирра Міхур Мряка Муляж Мурло Мусій Набій Навал Навкіл Намил Напів Нарда Нарти Насип Нахті Нафта Нацрі Незда Нелюб Немах Нерпа Неуки Нивка Носар Носак Ночви Нюхті Оброк Овид Оглав Огрій Огуда Окіл Окрай Окута Опука Орчик Осада Оскал Отар Оттак Офіра Охват Очеп Очкур Падло Пазух Пайка Пакіл Пакля Палас Палій Пам'ять Панів Паніч Панок Паплю Пардо Парсу Парти Паруб";
            words = list3.trim().split(" ");
        }

        int randomIndex = random.nextInt(words.length);
        // цикл, который выбирает рандом слово из списков
        for (int i = 0; i < words.length; i++) {
            if (i == randomIndex) {

                String hiddenWord = words[i];

            }
            break;
        }
        System.out.println("Комп'ютеh загадав слово");
        sc.close();
    }

    public static String usersInput() {

        Scanner sc = new Scanner(System.in);

        System.out.println("Хтось з вас загадує слоово. (НЕ ПІДГЛЯДАТИ!!!!!)");

        String input = sc.nextLine();

        // проверка на праивльность длины слова
        do {
            if (input.length() < 5) {
                System.out.println("Ви ввели слово менше п'яти символів. Будь ласка, спробуйте ще раз");
            }
            else if (input.length() > 5) {
                System.out.println("Ви ввели слово більше п'яти символів. Будь ласка, спробуйте ще раз");
            }
            else {
                break;
            }
        }
        while (true);

        // проверка на наличие цифр в слове
        if (input.matches(".*\\d.*")) {
            System.out.println("Помилка: у слові є цифра! Спробуйте ще раз спробу");
        } else {
            System.out.println(" ");
        }

// цикл который кодирует слово загадоное
        for (int i = 0; i < input.length(); i++) {
            System.out.print("*");


        }
        sc.close();
        return input;
    }




}